{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"sparse": false, "input_dtype": "float32", "name": "input_1", "batch_input_shape": [null, 64, 64, 3]}}, {"class_name": "Convolution2D", "inbound_nodes": [[["input_1", 0, 0]]], "name": "convolution2d_1", "config": {"bias": true, "nb_col": 3, "init": "normal", "trainable": true, "nb_row": 3, "nb_filter": 32, "W_regularizer": null, "dim_ordering": "tf", "subsample": [1, 1], "activity_regularizer": null, "border_mode": "same", "b_regularizer": null, "activation": "relu", "b_constraint": null, "name": "convolution2d_1", "W_constraint": null}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["convolution2d_1", 0, 0]]], "name": "maxpooling2d_1", "config": {"border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf", "trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_1"}}, {"class_name": "Dropout", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "name": "dropout_1", "config": {"p": 0.15, "name": "dropout_1", "trainable": true}}, {"class_name": "Convolution2D", "inbound_nodes": [[["dropout_1", 0, 0]]], "name": "convolution2d_2", "config": {"bias": true, "nb_col": 3, "init": "normal", "trainable": true, "nb_row": 3, "nb_filter": 64, "W_regularizer": null, "dim_ordering": "tf", "subsample": [1, 1], "activity_regularizer": null, "border_mode": "same", "b_regularizer": null, "activation": "relu", "b_constraint": null, "name": "convolution2d_2", "W_constraint": null}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["convolution2d_2", 0, 0]]], "name": "maxpooling2d_2", "config": {"border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf", "trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_2"}}, {"class_name": "Dropout", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "name": "dropout_2", "config": {"p": 0.15, "name": "dropout_2", "trainable": true}}, {"class_name": "Convolution2D", "inbound_nodes": [[["dropout_2", 0, 0]]], "name": "convolution2d_3", "config": {"bias": true, "nb_col": 3, "init": "normal", "trainable": true, "nb_row": 3, "nb_filter": 64, "W_regularizer": null, "dim_ordering": "tf", "subsample": [1, 1], "activity_regularizer": null, "border_mode": "same", "b_regularizer": null, "activation": "relu", "b_constraint": null, "name": "convolution2d_3", "W_constraint": null}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["convolution2d_3", 0, 0]]], "name": "maxpooling2d_3", "config": {"border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf", "trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_3"}}, {"class_name": "Dropout", "inbound_nodes": [[["maxpooling2d_3", 0, 0]]], "name": "dropout_3", "config": {"p": 0.15, "name": "dropout_3", "trainable": true}}, {"class_name": "Flatten", "inbound_nodes": [[["dropout_3", 0, 0]]], "name": "flatten_1", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0]]], "name": "dense_1", "config": {"input_dim": null, "init": "normal", "output_dim": 1024, "bias": true, "trainable": true, "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "activation": "relu", "b_constraint": null, "name": "dense_1", "W_constraint": null}}, {"class_name": "Dropout", "inbound_nodes": [[["dense_1", 0, 0]]], "name": "dropout_4", "config": {"p": 0.15, "name": "dropout_4", "trainable": true}}, {"class_name": "Dense", "inbound_nodes": [[["dropout_4", 0, 0]]], "name": "dense_2", "config": {"input_dim": null, "init": "normal", "output_dim": 256, "bias": true, "trainable": true, "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "activation": "relu", "b_constraint": null, "name": "dense_2", "W_constraint": null}}, {"class_name": "Dense", "inbound_nodes": [[["dense_2", 0, 0]]], "name": "dense_3", "config": {"input_dim": null, "init": "normal", "output_dim": 64, "bias": true, "trainable": true, "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "activation": "relu", "b_constraint": null, "name": "dense_3", "W_constraint": null}}, {"class_name": "Dense", "inbound_nodes": [[["dense_3", 0, 0]]], "name": "dense_4", "config": {"input_dim": null, "init": "glorot_uniform", "output_dim": 1, "bias": true, "trainable": true, "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "activation": "linear", "b_constraint": null, "name": "dense_4", "W_constraint": null}}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_4", 0, 0]], "name": "model_1"}, "keras_version": "1.1.2"}